{"organizations": [], "uuid": "984ca933d6e75a4c2cb7081bbae7300b2ac53fe5", "thread": {"social": {"gplus": {"shares": 2}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 8}, "facebook": {"likes": 153, "shares": 153, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.nytimes.com", "main_image": "https://static01.nyt.com/images/2017/02/05/nyregion/05jpPERTCITY1/05jpPERTCITY1-facebookJumbo.jpg", "site_section": "http://drudgereportfeed.com/rss.xml", "section_title": "Drudge Report Feed", "url": "https://www.nytimes.com/2017/02/02/nyregion/marijuana-dogs-weed.html", "country": "US", "domain_rank": 98, "title": "Dogs on Marijuana: Not Cool...", "performance_score": 1, "site": "nytimes.com", "participants_count": 0, "title_full": "Dogs on Marijuana: Not Cool...", "spam_score": 0.0, "site_type": "blogs", "published": "2017-02-03T02:01:00.000+02:00", "replies_count": 0, "uuid": "984ca933d6e75a4c2cb7081bbae7300b2ac53fe5"}, "author": "", "url": "https://www.nytimes.com/2017/02/02/nyregion/marijuana-dogs-weed.html", "ord_in_thread": 0, "title": "Dogs on Marijuana: Not Cool...", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "The vet did not have to wonder why: A bag of white-chocolate marijuana goodies she had picked up in Colorado sat empty beside Bella. \nAdvertisement Continue reading the main story “Dog freaks out on pot” may sound like a scene from a stoner comedy or a viral video , but it happens surprisingly often. In New York City, veterinarians say, canine marijuana poisoning has become a daily occurrence. “We probably see close to one a day at one of our four hospitals,” said David Wohlstadter, senior emergency clinician for the city locations of the veterinary chain Blue Pearl . “And we’ve definitely seen an increase in the past couple of years.” Animal Medical Center says it treats several cases a week. Fortunately, the effects — lethargy, wobbling gait, dribbling urine and saliva, overreacting to sound and light and movement — are not life-threatening. Treatment usually consists of inducing vomiting, if the ingestion was recent enough, and simply keeping the dog hydrated in a quiet place until the drug clears, though that can take a couple of days. Tina Wismer, the medical director of the A.S.P.C.A.’s national animal poison control center , said she did not know of a single death from a dog eating marijuana that did not also involve chocolate, which is highly toxic. But a few have come close. Photo Bella, whose owner is a veterinarian, finished off a bag of white-chocolate marijuana goodies. Credit Caitlin Ochs for The New York Times “We always used to joke about treating marijuana with fluids and Doritos and Pink Floyd,” Ms. Wismer said. “But we have had some serious intoxication — animals that become comatose, with extremely low blood pressure.” The center saw a 144 percent increase in pet marijuana overdose calls from 2010 to 2015. New York State had more cases than other except California. It is unclear whether dogs have a lower tolerance than humans for THC, the psychoactive ingredient in marijuana, but regardless, the math is unforgiving: A single cookie potent enough to get a 150-pound human righteously stoned could have 10 times that effect on a 15-pound dog. “I’ve had owners come in and they are stoned and they recognize some of the severity, but they just think it’s the funniest thing and they can’t stop laughing in the exam room,” said Brett Levitzke, medical director of the Veterinary Emergency and Referral Group in Brooklyn. “To the poor dog, it’s not very funny.” \nAdvertisement (Some vets and pet owners have used marijuana derivatives to treat seizures and pain and to stimulate appetite, but those products usually do not contain THC.) Sometimes, the owner is slow to come clean about the cause of the dog’s malaise. “I tell them, ‘Look, I’m not the police, I really don’t care, it’s just going to help me diagnose your dog a lot quicker,’” Dr. Levitzke said. He explained that a confession could also save money on tests for more serious conditions like kidney failure and liver disease that produce similar symptoms. Often, Dr. Levitzke said, owners will say the animal got into their roommate’s stash. Please verify you're not a robot by clicking the box. Invalid email address. Please re-enter. You must select a newsletter to subscribe to. Sign Up Receive occasional updates and special offers for The New York Times's products and services. Thank you for subscribing. An error has occurred. Please try again later. You are already subscribed to this email.", "external_links": [], "published": "2017-02-03T02:01:00.000+02:00", "crawled": "2017-02-02T21:06:37.131+02:00", "highlightTitle": ""}