{"organizations": [], "uuid": "bff3bb70603c5900edf91736445bba167995369e", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 773, "shares": 773, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.pbs.org", "main_image": "", "site_section": "http://www.pbs.org/about/blogs/news/category/pbs-kids/", "section_title": "pbs kids", "url": "http://www.pbs.org/about/blogs/news/pbs-kids-premieres-new-one-hour-dinosaur-train-special-monday-february-20/", "country": "US", "domain_rank": 1044, "title": "KIDS Premieres New One-Hour DINOSAUR TRAIN Special, Monday, February 20", "performance_score": 7, "site": "pbs.org", "participants_count": 1, "title_full": "PBS KIDS Premieres New One-Hour DINOSAUR TRAIN Special, Monday, February 20 | PBS About", "spam_score": 0.026, "site_type": "blogs", "published": "2017-02-01T02:00:00.000+02:00", "replies_count": 0, "uuid": "bff3bb70603c5900edf91736445bba167995369e"}, "author": "pbs.org", "url": "http://www.pbs.org/about/blogs/news/pbs-kids-premieres-new-one-hour-dinosaur-train-special-monday-february-20/", "ord_in_thread": 0, "title": "KIDS Premieres New One-Hour DINOSAUR TRAIN Special, Monday, February 20", "locations": [], "entities": {"persons": [{"name": "halle stanford", "sentiment": "none"}, {"name": "charlie chaplin", "sentiment": "none"}, {"name": "julie andrews", "sentiment": "none"}, {"name": "julie", "sentiment": "none"}, {"name": "jenny gusella", "sentiment": "none"}, {"name": "craig bartlett", "sentiment": "none"}, {"name": "lisa henson", "sentiment": "none"}, {"name": "jim henson", "sentiment": "none"}, {"name": "henson", "sentiment": "none"}, {"name": "don", "sentiment": "none"}, {"name": "natasha necrolestes", "sentiment": "none"}, {"name": "lubna abuulbah", "sentiment": "none"}, {"name": "alexander", "sentiment": "none"}], "locations": [{"name": "earth", "sentiment": "none"}, {"name": "new york", "sentiment": "none"}, {"name": "turkey hollow", "sentiment": "none"}, {"name": "america", "sentiment": "none"}, {"name": "singapore", "sentiment": "none"}, {"name": "fossil alley", "sentiment": "none"}, {"name": "asia", "sentiment": "none"}, {"name": "los angeles", "sentiment": "none"}, {"name": "london", "sentiment": "none"}], "organizations": [{"name": "word party", "sentiment": "none"}, {"name": "henson recording studios", "sentiment": "none"}, {"name": "amazon fire tv", "sentiment": "none"}, {"name": "singapore media development authority", "sentiment": "none"}, {"name": "the jim henson company", "sentiment": "none"}, {"name": "dinosaur train", "sentiment": "none"}, {"name": "pbs kids", "sentiment": "none"}, {"name": "disney", "sentiment": "none"}, {"name": "facebook", "sentiment": "none"}, {"name": "fraggle rock", "sentiment": "none"}, {"name": "pbs", "sentiment": "none"}, {"name": "jim henson company", "sentiment": "none"}, {"name": "jim henson company the jim henson company", "sentiment": "none"}, {"name": "apple tv", "sentiment": "none"}, {"name": "pbs distribution", "sentiment": "none"}, {"name": "netflix", "sentiment": "none"}, {"name": "sparky animation", "sentiment": "none"}, {"name": "company", "sentiment": "none"}, {"name": "kiddie academy", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "“What’s at the Center of the Earth?” takes kids on a new science adventure\nPBS KIDS’ series DINOSAUR TRAIN will premiere an all-new one-hour special, “What’s at the Center of the Earth?,” on Monday, February 20. Created by Craig Bartlett (READY JET GO!) and produced by The Jim Henson Company, DINOSAUR TRAIN encourages kids ages 3-6 to apply scientific thinking as they discover new types of dinosaur species, and to embrace the living sciences of paleontology and natural science.\n“With this new DINOSAUR TRAIN special, we are excited to give families another opportunity to engage with their favorite characters and learn about nature and science,” “By delivering educational programming through our member stations and their newly launched PBS KIDS 24/7 channel and live stream, we look forward to continuing to serve America’s children anytime and anywhere.”\nIn “What’s at the Center of the Earth?,” the Conductor has a special surprise for the Pteranodon Family: the Dinosaur Drill Train. This amazing machine gives its passengers a front row seat as they dig deep underground on a once-in-a-lifetime adventure below the Earth’s surface. There, they discover a whole new world – from fossils and troglobites to rivers of lava. Along the way, the family gains a new perspective on our planet and what it’s made of.\nFollowing its premiere, “What’s at the Center of the Earth?” will repeat throughout February on PBS stations and the PBS KIDS 24/7 channel and live stream. It will also be available for free on both pbskids.org and the PBS KIDS Video App , which is accessible on a variety of mobile devices and platforms such as Roku, Apple TV, Amazon Fire TV, Android TV, Xbox One and Chromecast. In addition, “What’s at the Center at the Earth?” and four additional DINOSAUR TRAIN stories will be available on DVD from PBS Distribution on Tuesday, February 21.\nNew digital content from DINOSAUR TRAIN will include “Fossil Finder,” a game that encourages kids to travel underground in the Drill Train to search for fossils. The game will be available the week of February 13 th on pbskids.org and on the free PBS KIDS Games app.\nDINOSAUR TRAIN airs weekdays on PBS KIDS (check local listings) and daily on the PBS KIDS 24/7 channel and live stream.\nDINOSAUR TRAIN is produced by The Jim Henson Company and co-produced with Singapore animation company Sparky Animation, with the participation and assistance of the Singapore Media Development Authority. The series is executive produced by Lisa Henson and Halle Stanford for The Jim Henson Company. Craig Bartlett also serves as executive producer. The Jim Henson Company oversees all ancillary exploitation of the property, including distribution, licensing and merchandising in all markets other than Asia, which is administered by Sparky Animation. PBS handles DVD distribution to North American consumer and education markets. Kiddie Academy is a proud sponsor of DINOSAUR TRAIN ® on PBS KIDS®\n“What’s at the Center of the Earth?” – a one-hour special including the following stories:\n“What’s at the Center of the Earth?” – Layers!\nThe Conductor takes the Pteranodon family on a very special journey on a new invention – the Drill Train – in search of the perfect spot for a new underground Dinosaur Train station! Don is THRILLED to be venturing into the BIGGEST HOLE THE EARTH HAS EVER KNOWN! Shiny is nervous to be underground, until they meet a new friend (a Mesozoic mole named Natasha Necrolestes), who teaches them all about the different layers of the Earth.\n“What’s at the Center of the Earth?” – Fossils!\nAs the Pteranodon family continues their journey underground, Don accidentally breaks Buddy’s trilobite fossil (the oldest fossil in his collection)! When the search for another trilobite fossil turns up empty, their new friend Natasha Necrolestes takes them to Fossil Alley, where the kids learn that the older the fossil, the deeper underground it is.\n“What’s at the Center of the Earth?” – Troglobites!\nThe Drill Train burrows into an underground limestone cave, where the Pteranodon family meets some strange eyeless creatures called “troglobites.” In a contest to see who would make the best troglobite, Buddy, Tiny, Shiny and Don participate in a treasure hunt – with their eyes closed! The kids have to rely on their other senses (with some guidance from the actual troglobites) to navigate the cave and find the prize.\n“What’s at the Center of the Earth?” – Minerals!\nWhile digging even further underground, the drill bit on the Drill Train breaks. The Pterandons find themselves in the Cave of Giant Crystals, where they learn all about rocks and crystals (what they are, how they’re different, how they form). In order to get back home, the Pteranodon family has to fix the drill bit by finding a mineral harder than the mineral that broke the bit in the first place.\nAbout PBS KIDS\nPBS KIDS, the number one kids, offers all children television, digital platforms and community-based programs. Kidscreen- and Webby Award-winning pbskids.org provides engaging interactive content, including digital games and streaming video. PBS KIDS also offers mobile apps to help support young children’s learning. The PBS KIDS Video App is available on a variety of mobile devices and on platforms such as Roku, Apple TV, Amazon Fire TV, Android TV, Xbox One and Chromecast. For more information on specific PBS KIDS content supporting literacy, science, math and more, visit pbs.org/pressroom, or follow PBS KIDS on Twitter and Facebook .\nAbout The Jim Henson Company\nThe Jim Henson Company has remained an established leader in family entertainment for over 60 years and is recognized worldwide as an innovator in puppetry, animatronics and digital animation. Best known as creators of the world famous Muppets, Henson has received over 50 Emmy Awards and nine Grammy Awards. Recent credits include the Emmy®-nominated Sid the Science Kid , Dinosaur Train , and Pajanimals , the CG-animated preschool series Doozers, the digital citizenship series for preschoolers Dot. , the Netflix series for young preschoolers Word Party , the marine biology themed animated series on PBS KIDS Splash and Bubbles and the Netflix Original preschool show Julie’s Greenroom , starring award-winning actress Julie Andrews. Features include Disney’s Alexander and the Terrible, Horrible, No Good, Very Bad Day , as well as The Dark Crystal , Labyrinth , and MirrorMask . Television productions include Fraggle Rock , the sci-fi cult series Farscape , Henson Alternative’s No, You Shut Up! and the TV film Jim Henson’s Turkey Hollow .\nWith additional locations in New York and London, The Jim Henson Company is headquartered in Los Angeles on the historic Charlie Chaplin lot, complete with soundstage and postproduction facilities. The Company is home to Jim Henson’s Creature Shop™, a pre-eminent character- building and visual effects group with international film, television, theme park and advertising clients, as well as Henson Recording Studios, one of the music industry’s top recording facilities known for its world-class blend of state-of- the-art and vintage equipment. The Company’s Henson Alternative brand is currently touring Puppet-Up! – Uncensored , a live puppet improvisational show.\nhttp://www.henson.com\nwww.facebook.com/hensoncompany\nwww.twitter.com/hensoncompany\nContacts:\nLubna Abuulbah, PBS; 703.739.8463; labuulbah@pbs.org\nJenny Gusella, 360PR+; 617.585.5762; jgusella@360pr.plus", "external_links": ["http://www.henson.com/", "http://www.facebook.com/hensoncompany", "http://www.twitter.com/hensoncompany", "http://pbskids.org/apps/pbs-kids-video.html", "http://www.facebook.com/pbskids", "http://pbskids.org/dinosaurtrain/", "http://twitter.com/pbskids"], "published": "2017-02-01T02:00:00.000+02:00", "crawled": "2017-02-02T00:02:44.499+02:00", "highlightTitle": ""}