{"organizations": [], "uuid": "7fa98d26d6988b36b5657f61b84f6294c4c1b1c8", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 221}, "facebook": {"likes": 149, "shares": 149, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.nytimes.com", "main_image": "http://fm.cnbc.com/applications/cnbc.com/resources/img/editorial/2013/06/11/100807355-ANTHONY_SCARAMUCCI.1910x1000.jpg", "site_section": "http://www.cnbc.com/id/19746125/device/rss/rss.xml#", "section_title": "Top News and Analysis (pro)", "url": "https://www.nytimes.com/2017/02/01/us/politics/anthony-scaramucci-china-trump-administration.html?_r=0", "country": "US", "domain_rank": 98, "title": "Republican donor Scaramucci won’t get announced White House role, official says", "performance_score": 1, "site": "nytimes.com", "participants_count": 0, "title_full": "Republican donor Scaramucci won’t get announced White House role, official says", "spam_score": 0.0, "site_type": "blogs", "published": "2017-02-02T17:32:00.000+02:00", "replies_count": 0, "uuid": "7fa98d26d6988b36b5657f61b84f6294c4c1b1c8"}, "author": "", "url": "https://www.nytimes.com/2017/02/01/us/politics/anthony-scaramucci-china-trump-administration.html?_r=0", "ord_in_thread": 0, "title": "Republican donor Scaramucci won’t get announced White House role, official says", "locations": [], "entities": {"persons": [{"name": "scaramucci", "sentiment": "negative"}, {"name": "anthony scaramucci", "sentiment": "negative"}, {"name": "maggie haberman", "sentiment": "negative"}, {"name": "richard w. painter", "sentiment": "none"}, {"name": "bannon", "sentiment": "none"}, {"name": "trump", "sentiment": "none"}, {"name": "stephen k. bannon", "sentiment": "none"}, {"name": "george w. bush", "sentiment": "none"}, {"name": "reince priebus", "sentiment": "none"}, {"name": "priebus", "sentiment": "none"}], "locations": [{"name": "new york", "sentiment": "none"}, {"name": "america", "sentiment": "none"}, {"name": "us", "sentiment": "none"}, {"name": "white house", "sentiment": "none"}, {"name": "china", "sentiment": "none"}], "organizations": [{"name": "white house", "sentiment": "negative"}, {"name": "skybridge capital", "sentiment": "none"}, {"name": "office of public liaison and intergovernmental affairs", "sentiment": "none"}, {"name": "skybridge", "sentiment": "none"}, {"name": "national security council", "sentiment": "none"}, {"name": "hna", "sentiment": "none"}, {"name": "communist party", "sentiment": "none"}, {"name": "hna group", "sentiment": "none"}, {"name": "white house counsel's office", "sentiment": "none"}, {"name": "new york times", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "Anthony Scaramucci Won’t Get Announced White House Role, Official Says Maggie Haberman The New York Times SHARES \nAnthony Scaramucci, an investment firm founder and a Republican donor, will not be taking a senior job at the White House as previously announced, a senior administration official said Wednesday. \nMr. Scaramucci was informed on Wednesday by Reince Priebus , President Trump's chief of staff, and by Stephen K. Bannon , the president's top strategist, that he would not get the job as liaison to the business community. \nMr. Priebus and Mr. Bannon, the official said, plan to find another role in the administration for Mr. Scaramucci in the future. The official spoke on the condition of anonymity because Mr. Scaramucci's name had not officially been withdrawn. \nMore from NYT: \nJudge orders US to let In immigrant visa holders \nAt issue is Mr. Scaramucci's sale of his firm, SkyBridge Capital, to a division of HNA Group, a politically connected Chinese conglomerate that would become the firm's majority owner. The sale has not been completed, and administration officials said the White House Counsel's Office had predicted that it would take up to three months for Mr. Scaramucci to be cleared of potential ethics conflicts. \nThe White House is operating without a functioning Office of Public Liaison and Intergovernmental Affairs, which Mr. Scaramucci would have led. Part of the job is to help coordinate matters across government agencies, a pressing need as protests over the president's immigration order sweep the country. \nThe New York Times reported Tuesday that HNA Group has strong ties to China's ruling Communist Party and an opaque ownership structure. China experts say leading Chinese firms like HNA are looking for avenues of influence in a White House that is already stoking tensions on trade and other issues. \nHNA, a financial behemoth whose interests range from aviation to supermarkets, has said that SkyBridge will give it a foothold in America's asset management business. The $180 million deal could be finalized as late as the end of June. \nTo avoid conflicts of interest, Mr. Scaramucci had agreed to recuse himself from anything to do with SkyBridge and HNA. One ethics lawyer suggested that he could have steered clear of the entire financial services sector and still carried out his duties. \n\"This does not seem to me to be a clear disqualifying factor,\" said Richard W. Painter, the chief White House ethics lawyer for two years under President George W. Bush. \"Another possibility is they decided not to keep him for a political reason and cited an ethics conflict as a cover.\" \nThis was not the first time that a West Wing nominee withdrew. Mr. Trump's choice for communications director backed out, as did a deputy National Security Council pick accused of plagiarism.", "external_links": [], "published": "2017-02-02T17:32:00.000+02:00", "crawled": "2017-02-02T12:50:00.958+02:00", "highlightTitle": ""}