{"organizations": [], "uuid": "5368d169904d8a23fee6fee8485f61a83f209906", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 240, "shares": 240, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "ca.sports.yahoo.com", "main_image": "https://s1.yimg.com/bt/api/res/1.2/dxa4TfetRATnBOnNGxAxHQ--/YXBwaWQ9eW5ld3NfbGVnbztxPTc1O3c9NjAw/http://media.zenfs.com/en/homerun/feed_manager_auto_publish_494/b8f462a25ade8cb4789d9b462033158d.cf.png", "site_section": "http://heresalink.com/rss", "section_title": "(no title)", "url": "https://ca.sports.yahoo.com/news/meet-briante-weber-the-best-nba-free-agent-up-for-grabs-191344660.html", "country": "GB", "domain_rank": 5, "title": "Briante Weber, the best NBA free agent up for grabs", "performance_score": 2, "site": "yahoo.com", "participants_count": 0, "title_full": "Briante Weber, the best NBA free agent up for grabs", "spam_score": 0.0, "site_type": "blogs", "published": "2017-02-02T04:20:00.000+02:00", "replies_count": 0, "uuid": "5368d169904d8a23fee6fee8485f61a83f209906"}, "author": "", "url": "https://ca.sports.yahoo.com/news/meet-briante-weber-the-best-nba-free-agent-up-for-grabs-191344660.html", "ord_in_thread": 0, "title": "Briante Weber, the best NBA free agent up for grabs", "locations": [], "entities": {"persons": [{"name": "briante weber", "sentiment": "positive"}, {"name": "dave eggen/getty ima", "sentiment": "neutral"}, {"name": "randy belice/getty images", "sentiment": "none"}, {"name": "weber", "sentiment": "none"}, {"name": "stefan jankovic", "sentiment": "none"}, {"name": "chris bosh", "sentiment": "none"}, {"name": "john wall", "sentiment": "none"}, {"name": "brianté weber", "sentiment": "none"}, {"name": "kyle lowry", "sentiment": "none"}, {"name": "brianté", "sentiment": "none"}, {"name": "isaiah thomas", "sentiment": "none"}], "locations": [{"name": "chesapeake", "sentiment": "none"}, {"name": "sioux falls skyforce", "sentiment": "none"}, {"name": "miami", "sentiment": "none"}, {"name": "virginia", "sentiment": "none"}, {"name": "mississauga", "sentiment": "none"}, {"name": "hershey centre", "sentiment": "none"}, {"name": "sioux falls", "sentiment": "none"}, {"name": "memphis", "sentiment": "none"}, {"name": "mississauga", "sentiment": "none"}], "organizations": [{"name": "nba", "sentiment": "positive"}, {"name": "sioux falls skyforce", "sentiment": "negative"}, {"name": "mitchell leff/getty images", "sentiment": "none"}, {"name": "yahoo canada sports", "sentiment": "none"}, {"name": "los angeles d-fenders", "sentiment": "none"}, {"name": "ncaa", "sentiment": "none"}, {"name": "sixers", "sentiment": "none"}, {"name": "nbadl", "sentiment": "none"}, {"name": "vcu", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": ". Briante Weber has been a triple-double machine for the Sioux Falls Skyforce. (Dave Eggen/Getty Images) \nMISSISSAUGA – With how quickly his feet hop and how smoothly he slides defensively you almost never notice the bulky brace. \nNow just a phone call away from the NBA, Brianté Weber has come a long way from the knee injury that ended his NCAA career and stole his chance at the record books. \nIn Mississauga for the NBA’s D-League Showcase as the top prospect in the developmental league, Weber knew his chance could come at any second. The five-day showcase is the last big chance these players have to earn a 10-day contract on an NBA roster, as many of the top rookies and prospects have long found teams by January. \n“I’ve got a lot of looks, a lot of people that’s excited and like me but I just want another opportunity to showcase myself,” Weber told Yahoo Canada Sports late last month, outside his team’s locker room following a 28-point, eight-assist, seven-rebound performance in a win over the Los Angeles D-Fenders. \nAn all-around threat, Weber leads the D-League in triple-doubles and capped off a promising month of January with an impressive 16-point, 12-assist, 10-rebound, nine-steal performance – just one theft shy of the D-League’s first ever quadruple-double. \nThe rare feat hasn’t happened since 1994 and has only been accomplished four times in NBA history -and just once with steals. It’s a performance that will pique the interest of NBA teams who already have Weber on their radar. \nFor those who didn’t have him on their radar, his play at the Hershey Centre in Mississauga certainly opened some eyes among the scouts, coaches and representatives of all 30 NBA teams in attendance. \n“It’s definitely a place where a lot of heads can get turned by your play or just how you carry yourself on and off the court,” Weber said. View gallery . Briante Weber dunks the ball against the Los Angeles D-Fenders in the NBA D-League Showcase at the Hershey Centre. (Randy Belice/Getty Images) \nWeber’s Sioux Falls Skyforce are the defending D-League champions, winning the franchise’s first title after a record-setting season last year where they finished 40-10. \nAt 6-foot-2 with long arms, the Chesapeake, Virginia, native is a defensive guard who leads the D-League in steals (3.17 per game) and controls the game on both ends. Weber has averaged 15.4 points on 44.2 percent shooting, 7.4 rebounds and 7.2 assists this season, fourth in the D-League. \nHe’s efficient with the ball, possessing a 2.5 assist-to-turnover ratio, better than NBA star guards like Kyle Lowry, Isaiah Thomas, and John Wall. He’s also a demonstrative leader. \n“He brings firstly the defence – or as we say ‘Bri-fence’ – you know his defence is on another level,” said Sioux Falls teammate Stefan Jankovic, who grew up in Mississauga. “He holds others accountable. I’ve been playing with Brianté since the Summer League and he stays on me, which you need from your point guard. \n“I definitely think he’s an NBA player and he played in the NBA last season for a reason, too. His call-up is coming any time soon.” \nWeber’s motto this season – #NewBeginning – refers to his rebuilt knee and rediscovered focus. View gallery . A knee injury brought a premature end to Weber’s near-historic NCAA career. (Mitchell Leff/Getty Images) \nAs a senior at VCU in early 2015, Weber suffered a torn ACL and meniscus that ended his college career just 12 steals away from the all-time NCAA record. A three-time A-10 Defensive Player of the Year, Weber went undrafted in the 2015 NBA Draft and now two years later has worked his way back to become the No. 1 prospect in the D-League. \n“I had to learn to just be patient,” Weber said. “You can’t rush that. The way I move and the way I play and cut I had to make sure I was going to be 100 percent out there. You take the good with the bad on the journey and I’m here now and ready for the next step.” \nWeber had late-season stints with Miami, the NBA affiliate of the Skyforce, and Memphis a year ago, and was the last cut by the Heat in training camp this season. With Miami dealing with a rash of injuries and Chris Bosh’s contract eligible to be waived Feb. 9, a spot could open for Weber if he’s still available by that time. \nMiami isn’t his only option, however. Like m ost NBADL players, Weber has a contract with the league rather than an individual team, so he is technically a free agent. He just recently had a tryout for the Sixers, who ultimately decided to go in another direction. \nBut with his shots going in and his knee feeling good, it’s only a matter of time before Weber steals back a career that was almost taken from him too soon. Sports & Recreation", "external_links": [], "published": "2017-02-02T04:20:00.000+02:00", "crawled": "2017-02-02T00:26:39.733+02:00", "highlightTitle": ""}