{"organizations": [], "uuid": "34c5c304355f2bbecdb571c06e8316e5c7302757", "thread": {"social": {"gplus": {"shares": 3}, "pinterest": {"shares": 1}, "vk": {"shares": 0}, "linkedin": {"shares": 26}, "facebook": {"likes": 172, "shares": 172, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "spectrum.ieee.org", "main_image": "", "site_section": "http://spectrum.ieee.org", "section_title": "IEEE Spectrum Recent Content full text", "url": "http://spectrum.ieee.org/automaton/robotics/drones/otherlab-apsara-aerial-delivery-system", "country": "US", "domain_rank": 1895, "title": "Swarms of Disposable Drones Will Make Critical Deliveries and Then Vanish", "performance_score": 1, "site": "ieee.org", "participants_count": 1, "title_full": "Swarms of Disposable Drones Will Make Critical Deliveries and Then Vanish", "spam_score": 0.0, "site_type": "blogs", "published": "2017-02-02T05:05:00.000+02:00", "replies_count": 0, "uuid": "34c5c304355f2bbecdb571c06e8316e5c7302757"}, "author": "", "url": "http://spectrum.ieee.org/automaton/robotics/drones/otherlab-apsara-aerial-delivery-system", "ord_in_thread": 0, "title": "Swarms of Disposable Drones Will Make Critical Deliveries and Then Vanish", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "San Francisco R&D firm develops low-cost, precision air-delivery system using paper gliders Photo: Otherlab San Francisco R&D firm Otherlab is developing a low-cost, precision air-delivery system using paper drones. The drones have no propellers and use an autopilot and servos to glide and steer themselves. Delivery drones still face an uncertain future, but there’s at least one scenario where they make a lot of sense: Flying robots can be ideal for bringing small, high value, time-sensitive goods to people in low-infrastructure areas. As specific a situation as that sounds like, it’s an enormous opportunity, and has the potential to make a huge difference in rural areas and disaster relief missions with deliveries of food and medical supplies, for example.\nOne challenge with that, however, is that while drones are cheap to operate, the up-front investment is significant, especially if you need to make a lot of deliveries quickly, like right after an earthquake. With this sort of thing in mind, DARPA has funded several companies under its ICARUS (Inbound, Controlled, Air-Releasable, Unrecoverable Systems) program to create cheap, disposable drones that are designed to deliver a thing to a place and then be forgotten about. One of the companies receiving DARPA funding is San Francisco research firm Otherlab , which does weird robotics-y stuff with creative materials , among other things, and they’ve come up with a design for a drone they’re calling APSARA: Aerial Platform Supporting Autonomous Resupply/ Actions.\n\nOtherlab’s APSARA drones are made almost entirely of cardboard, with some packing tape mixed in. They’re about a meter in size and don’t have propellers: They are designed to be launched from other aircraft and glide, using some very basic hardware (GPS, an autopilot, some small servos, and a disposable battery) to steer themselves. Otherlab says the drones can travel distances of up 150 kilometers, and land within 10 meters of their target. And once they deliver their 1-kilogram payloads, you’re supposed to just forget about them—they’ll degrade and disappear on their own. At the moment only the cardboard airframe is degradable—Otherlab used low-cost conventional electronic components for the hardware—but DARPA is funding a separate program called Vanishing Programmable Resources (VAPR) , to develop electronics capable of “ physically disappearing in a controlled, triggerable manner. ” \n“It’s like the Ikea of drones: It comes as a flat-pack thing with a bunch of sheets of cardboard that’s been laser cut and scored, and you can fold it up when you’re ready to go” —Mikell Taylor, Otherlab “We knew it had to disappear,” says Mikell Taylor , team lead at Otherlab’s Everfly ( and Automaton alum ). “That pointed us to a fairly limited range of materials.” She explained that Otherlab does a lot of rapid prototyping using cardboard with very precise curves and shapes, and that capability helped hugely with the design of the APSARA drones . “It’s like the Ikea of drones: It comes as a flat-pack thing with a bunch of sheets of cardboard that’s been laser cut and scored, and you can fold it up when you’re ready to go,” she says. “It’s easy to assemble, you just tape it together.”\nTaylor told us that the assembly process usually takes about 30 minutes per drone. It’s very straightforward, and could be made even easier by pre-printing instructions on the drones themselves. The goal is to make the design simple enough that it requires no skill or experience to construct.\nOnce you’ve got the drone put together, launching it is (to be fair) a bit of a hassle. As a glider, the APSARA drones require that you give them a substantial amount of starting altitude. Otherlab envisions dumping a couple hundred of them out the back of a C-17 transport aircraft at 35,000 feet, which is where they get their 150 km maximum range, but you don’t necessarily need to go up that high. The drones are very efficient, with an excellent glide ratio; it’s simply that the higher you drop them from, the farther they’ll be able to go.\nIllustration: Otherlab Otherlab says the combined range of a large transport airplane and the gliders deployed from it “would allow the single airplane to conduct delivery operations covering an area the size of California.” Otherlab has experimented with a variety of landing techniques, but for now, they’ve settled on a spiral down to a controlled crash landing. Remember, the drones are designed to be disposable, so “crash” is perfectly acceptable—as long as the payload arrives safely, a landing that’s more crashy really just means that the drone is getting a head start on disposing of itself. Of course, “dispose of” can mean a lot of different things. DARPA’s looking for drones that can essentially cease to exist within hours or days, and, at least for the paper components, Otherlab might be able to do that using special cardboard that’s been impregnated with mushroom spores. Or maybe you want the material of the drone to be useable to the person receiving the delivery somehow. This is all part of what’s so interesting about DARPA’s ICARUS program: There are all kinds of different ways of tweaking the design to make drones that are both disposable and useful at the same time.\nOtherlab also had to keep costs at a minimum so that the drones are so cheap that you don’t have to worry about not getting them back. How cheap? Taylor wouldn’t comment specifically on price, except to say that it’s “really, really cheap,” to the point where in most use cases, users won’t care if they lose all of them. And this is the key—the change in mindset that comes with being able to just not care if your drones never come back, which lets you focus on the deliveries, as opposed to recovering your delivery assets, as Taylor explains:\n“I think that’s why there’s been so much excitement about this: If you look at the way goods are delivered by drone right now, whether you’re a humanitarian agency, the military, or whoever, all the logistics of delivering has to budget for really high losses, because stuff goes wrong. If you have the delivery mechanism be this cheap, it opens up a lot of opportunity to get more stuff to people who need it more effectively.” \nOtherlab’s grant under DARPA’s ICARUS program has concluded, but the company is looking at a few different potential sources for funding. Taylor tells us that there’s been a substantial amount of interest in this project, and we can’t wait to see what happens with it.\n[ Otherlab ]\n", "external_links": [], "published": "2017-02-02T05:05:00.000+02:00", "crawled": "2017-02-02T00:19:08.567+02:00", "highlightTitle": ""}