{"organizations": [], "uuid": "55f172afa6c5ad2dd30c711b1e2a21bf63e9e426", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 7}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 423, "shares": 423, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.top10homeremedies.com", "main_image": "http://www.top10homeremedies.com/wp-content/uploads/2017/01/feat-heal-a-burnt-tongue.jpg", "site_section": "http://www.top10homeremedies.com/feed", "section_title": "Top 10 Home Remedies", "url": "http://www.top10homeremedies.com/how-to/heal-burnt-tongue.html", "country": "US", "domain_rank": 8115, "title": "How to Heal a Burnt Tongue", "performance_score": 4, "site": "top10homeremedies.com", "participants_count": 1, "title_full": "How to Heal a Burnt Tongue", "spam_score": 0.0, "site_type": "blogs", "published": "2017-01-31T19:20:00.000+02:00", "replies_count": 0, "uuid": "55f172afa6c5ad2dd30c711b1e2a21bf63e9e426"}, "author": "AP", "url": "http://www.top10homeremedies.com/how-to/heal-burnt-tongue.html", "ord_in_thread": 0, "title": "How to Heal a Burnt Tongue", "locations": [], "entities": {"persons": [], "locations": [], "organizations": [{"name": "manuka", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "Home » How To » How to Heal a Burnt Tongue How to Heal a Burnt Tongue   \nWe’ve all put a forkful of food into our mouth or taken a sip of a fresh cup of coffee that is hotter than expected, then tried desperately to soften the blow by fanning our open mouth with our hands to cool it down. \nWhile this often works, at times you may end up with an actual burn on your mouth, lips or tongue. \nSome people feel a burning sensation on their tongue all the time for no apparent reason. This is a medical condition known as burning tongue syndrome and is different from a burnt tongue. \nNo matter what, a burnt tongue affects your taste buds and lessens your sense of taste. Depending on the degree of the burn, you also may have symptoms like pain, redness on the tongue’s surface, swelling and even blisters. \nEven a mild burn on your tongue can cause a lot of discomfort, which you may mostly experience when you eat or drink something warm. \nThe burn will heal eventually, but you can speed up the process with some simple home remedies. \nA severe burn can lead to an infection. If the burn is severe, consult a doctor immediately. \nHere are the top 10 ways to heal a burnt tongue. 1. Breathe through Your Mouth \nAs soon as you have eaten something very hot, spit it out and stick your tongue out of your mouth and start breathing orally. \nWhen you breathe through your mouth, cold air flows over the surface of your tongue and provides relief from the pain. \nKeep breathing oodles of air with your tongue out until you get relief. 2. Have Something Cold \nAnother good first response to a burnt tongue is to get something cold on it as soon as possible. It will help bring down the temperature of your burning tongue. \nIt will also reduce inflammation and prevent tissue damage. Plus, it will keep your mouth hydrated to ensure harmful bacteria do not cause an infection . \nYou can: Suck on an ice cube or lick an ice pop. Eat your favorite ice cream or drink some cold juice. Take small sips of cold water. \nTry to hold any of these items in your mouth for as long as possible before swallowing. Keep doing it until your symptoms subside. 3. Swish with Warm Water \nSwishing warm water around in your mouth is another natural remedy for a burnt tongue. \nA 2013 study published in the Journal of Plastic, Reconstructive and Aesthetic Surgery reports that in order to limit damage after a burn injury, burn progression can be prevented with the application of warm water. It also improves the microcirculatory perfusion, which translates into increased tissue survival. \nIt is best to use warm salt water, as salt helps prevent an infection from developing in the mouth and around the damaged tissue on the tongue. Mix ½ teaspoon of salt in a glass of warm water. Swish the solution around in your mouth for 30 seconds before spitting it out. Do this several times a day until your tongue heals. 4. Honey \nHoney is another excellent home remedy to heal a burnt tongue. \nIts antibacterial nature prevents bacteria from infecting damaged skin. Plus, being a natural anti-inflammatory agent, honey reduces swelling and pain. \nA 2014 study published in the Annals of Burns and Fire Disasters highlights the anti-infectious and anti-inflammatory properties of honey, as well as its favorable effect on wound regeneration . Spread 1 teaspoon of Manuka honey over your tongue. Allow it to sit on your burnt tongue for as long as possible before swallowing. Repeat the process 2 or 3 times a day. \nNote: Honey should not be given to children under 1 year of age, as it can harbor toxic spores causing infant botulism. 5. Aloe Vera \nAloe vera is another amazing remedy to heal the burn on your tongue. \nIt not only soothes the damaged cells on the tongue but also aids healing. Plus, it helps reduce pain and inflammation. \nA 2007 study published in Burns analyzed several studies and concluded that aloe vera might be an effective intervention used in healing first- to second-degree burns. Extract fresh aloe vera gel from an aloe vera leaf and apply it all over the tongue to soothe the burn. Repeat several times a day. You can also freeze the aloe vera gel into ice cubes and suck on them regularly. 6. Yogurt \nYogurt is another burnt tongue remedy that can provide instant relief from the discomforts. \nThe soothing nature of yogurt takes away the heat from the burn. It also helps ease the pain of a sore and sensitive tongue . Take ½ cup of cold, plain yogurt. Eat a little and keep it in your mouth for a few seconds before swallowing. Repeat until you have eaten all the yogurt. Have yogurt a few times a day.  ", "external_links": [], "published": "2017-01-31T19:20:00.000+02:00", "crawled": "2017-02-02T12:26:58.330+02:00", "highlightTitle": ""}