{"organizations": [], "uuid": "526fd8ba21c00851578739b78512951fbb3b180d", "thread": {"social": {"gplus": {"shares": 6}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 13}, "facebook": {"likes": 572, "shares": 572, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.nytimes.com", "main_image": "https://static01.nyt.com/images/2017/02/02/world/02Germany1/02Germany1-facebookJumbo.jpg", "site_section": "http://feeds.nytimes.com/nyt/rss/World", "section_title": "NYT > World", "url": "https://www.nytimes.com/2017/02/01/world/europe/germany-terror-arrests-security-risks.html", "country": "US", "domain_rank": 98, "title": "1,000 Officers and One Arrest: German Terror Raids Sow Doubts", "performance_score": 5, "site": "nytimes.com", "participants_count": 1, "title_full": "1,000 Officers and One Arrest: German Terror Raids Sow Doubts", "spam_score": 0.0, "site_type": "blogs", "published": "2017-02-02T09:01:00.000+02:00", "replies_count": 0, "uuid": "526fd8ba21c00851578739b78512951fbb3b180d"}, "author": "ALISON SMALE", "url": "https://www.nytimes.com/2017/02/01/world/europe/germany-terror-arrests-security-risks.html", "ord_in_thread": 0, "title": "1,000 Officers and One Arrest: German Terror Raids Sow Doubts", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "But, as with Mr. Amri, who slipped through the Germans’ fingers several times over two years, the Germans said they could not deport the latest suspect because authorities in his country did not supply the necessary papers. \nAdvertisement   He was therefore released Nov. 4, said Alexander Badle, a spokesman for the Frankfurt state prosecutors. The suspect was watched around the clock until his arrest early Wednesday, Mr. Badle said, declining to comment on what led the authorities to order the giant raids in Frankfurt and eight surrounding cities and districts in the vast conurbation where the Rhine and Main Rivers meet. The Tunisian was the only person arrested in the raids, Mr. Badle said. He was held under a warrant issued Jan. 26 accusing him of supporting a foreign terrorist group. Investigation on that charge started in October, even before his release, according to the Frankfurt prosecutors’ office. It was not clear if any of the remaining 15 suspects were held even briefly by the police. Mr. Badle said in a brief telephone interview that the main Tunisian suspect had no fixed address and had slept variously at the homes of friends and contacts apparently made in mosques. German authorities routinely lament that they cannot watch all those suspected of Islamic extremism, but they appear to have kept unusually tight 24/7 surveillance on the Tunisian, which presumably yielded the names or locations of other suspects across the Rhine-Main area, home to millions. The suspects listed on Wednesday include a 17-year-old German Iraqi who in July tried to head for Dubai and from there to Syria for training in using weapons and explosives by unspecified terrorist groups, Mr. Badle said. Another would-be recruit, identified only as a 16-year-old German Afghan, tried to leave Frankfurt last September and head to Dubai and then Afghanistan before going to Syria for training in weapons and explosives, the prosecutor said. In Berlin, up to 250 police officers and three heavily armed antiterror units took part in the raid on a mosque in the Moabit district. Mr. Amri, the Christmas market assailant, had visited that mosque at least twice in the run-up to his Dec. 19 attack, and recorded a video dedicating himself to the Islamic State on a nearby bridge. The police said three men who frequented the mosque were detained on the street. They were ages 21, 31 and 45 and were suspected of being about to travel to Syria and Iraq to train and fight with the Islamic State, the police said. Two hold Turkish citizenship, and the third is German, said Martin Steltner, a spokesman for the Berlin state prosecutors. Ms. Merkel was far away in southwest Germany, receiving an award for showing charity toward the refugees from a group that honors a German Christian who took part in the unsuccessful plot to kill Hitler in 1944 and was executed by the Nazis in 1945. \nAdvertisement", "external_links": [], "published": "2017-02-02T09:01:00.000+02:00", "crawled": "2017-02-02T04:16:41.710+02:00", "highlightTitle": ""}