{"organizations": [], "uuid": "4565e9051506f5786ff08a16b61532e568ff47f4", "thread": {"social": {"gplus": {"shares": 1}, "pinterest": {"shares": 2}, "vk": {"shares": 0}, "linkedin": {"shares": 1}, "facebook": {"likes": 135, "shares": 135, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.theguardian.com", "main_image": "https://i.guim.co.uk/img/media/9a26d49d6df801e629211ba4c44e8744997e44d0/0_212_4288_2572/master/4288.jpg?w=1200&amp;h=630&amp;q=55&amp;auto=format&amp;usm=12&amp;fit=crop&amp;crop=faces%2Centropy&amp;bm=normal&amp;ba=bottom%2Cleft&amp;blend64=aHR0cHM6Ly91cGxvYWRzLmd1aW0uY28udWsvMjAxNi8wNS8yNS9vdmVybGF5LWxvZ28tMTIwMC05MF9vcHQucG5n&amp;s=50275df81b66c51a850b3d2b6d701530", "site_section": "http://www.guardian.co.uk/rssfeed/0,,12,00.xml", "section_title": "World news | The Guardian", "url": "https://www.theguardian.com/world/2017/feb/02/penelopegate-my-part-in-the-francois-fillon-scandal", "country": "GB", "domain_rank": 170, "title": "Penelopegate: my part in the François Fillon scandal", "performance_score": 1, "site": "theguardian.com", "participants_count": 1, "title_full": "Penelopegate: my part in the François Fillon scandal", "spam_score": 0.0, "site_type": "blogs", "published": "2017-02-03T00:51:00.000+02:00", "replies_count": 0, "uuid": "4565e9051506f5786ff08a16b61532e568ff47f4"}, "author": "Kim Willsher in Paris", "url": "https://www.theguardian.com/world/2017/feb/02/penelopegate-my-part-in-the-francois-fillon-scandal", "ord_in_thread": 0, "title": "Penelopegate: my part in the François Fillon scandal", "locations": [], "entities": {"persons": [{"name": "penelope fillon", "sentiment": "negative"}, {"name": "françois fillon", "sentiment": "negative"}, {"name": "pierre haski", "sentiment": "none"}, {"name": "pitman", "sentiment": "none"}, {"name": "fillon", "sentiment": "none"}, {"name": "penelope", "sentiment": "none"}, {"name": "françois", "sentiment": "none"}, {"name": "shakespeare", "sentiment": "none"}, {"name": "les républicains", "sentiment": "none"}], "locations": [{"name": "france", "sentiment": "none"}, {"name": "paris", "sentiment": "none"}], "organizations": [{"name": "le canard enchainé", "sentiment": "none"}, {"name": "telegraph", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "  17.51 GMT Last modified on   18.00 GMT \nThe interview in 2007 with Penelope Fillon, the Welsh-born wife of the then newly appointed French prime minister, was a gentle affair. \nSitting in her local cafe in a chic Paris arrondissement, we talked about family, including her five children, and how she preferred being in the country with her horses and studying Shakespeare than being part of the Parisian beau monde . She told of how she met her husband, François, discussed Welsh nationalism, and we laughed at how clumsy her name sounded with its French pronunciation: Pen-eh-loppe to rhyme with mop. Pressure mounts on François Fillon as jobs inquiry widens to include children Read more \nAccording to my interview notes, Fillon said she did “bits and pieces” for her husband, such as handing out leaflets during election campaigns. Then she said: “I have never actually been his assistant or anything like that. I don’t deal with his communication.” \nIn her hacking jacket and pink scarf, I wrote that Fillon looked as if she had stepped straight out of an English village fete. She was kindly, but reserved; answering my questions but seeming uncomfortable at the attention. The photographer asked if he could film the interview. Penelope said yes. \n“Once this week is over everything will die down and I will be able to carry on as before,” she told me. “I don’t get recognised in the street and I hope not to. That would horrify me.” \nA decade on, this seemingly inoffensive interview – and the key detail of whether she actually worked for her husband – has become a key part of “Penelopegate”, a scandal that threatens to destroy the political career of the man who, until just a few weeks ago, was the clear favourite to be France’s next president. \nThe scandal erupted when the satirical newspaper Le Canard Enchainé reported that Fillon had paid his wife a total of €800,000 (£690,000) from public funds to work as his parliamentary assistant. There is nothing illegal in that: French parliamentarians are allowed to employ spouses, children, second cousins twice removed, as long as the person actually works (although it is not exactly clear what a parliamentary assistant should do). \nThe question being asked has been: did Fillon actually work? Her husband has said yes, insisting her job was “real” and “legal”. \nThen, amid the claims and counterclaims, someone discovered my gentle, inoffensive and seemingly uncontroversial interview published in the Sunday Telegraph on 20 May 2007. My telephone began ringing. \nI referred the many media callers back to the original interview, saying I had nothing to add and scrabbled to find my notebook from 10 years ago. After three days of calls, I reluctantly agreed to be interviewed by Envoyé Special, a programme on the public service broadcaster France2, to describe how my meeting with Fillon came about and to “put it into context”. \nNo, I said, I couldn’t remember asking Fillon if she worked for her husband, and no, I couldn’t remember if she had mentioned it, because it was 10 years ago and it wasn’t the point of the article I was writing then. Scandal, radicals and insurgencies – all bets are off for the French presidency | Pierre Haski Read more \nAfter that interview, France2 obtained the film of my interview with Fillon – footage I have still never seen – and I found my interview notes in Pitman shorthand. \nHer assertion – which only appeared in the video version of the interview and is no longer available on the Telegraph website – that she had “never been his assistant or anything like that” is, for many, the smoking gun of the scandal. \nLast autumn, after her husband became the presidential candidate for Les Républicains, I contacted Fillon for the first time in a decade to ask if she would speak to me again. She sent a friendly reply suggesting she would. \nUntil a week ago, I was still hopeful it would happen. But I doubt Fillon will speak to me now. And, though it is not my fault, who could blame her?", "external_links": [], "published": "2017-02-03T00:51:00.000+02:00", "crawled": "2017-02-02T20:37:06.244+02:00", "highlightTitle": ""}